group-reports/sharif/results/100G-disk-throughput-tuning-protocol-A-sndbuf-2M/test-3.txt
read-randomly-test-job: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=16
...
fio-3.7
Starting 16 processes
read-randomly-test-job: Laying out IO file (1 file / 102400MiB)

read-randomly-test-job: (groupid=0, jobs=16): err= 0: pid=129006: Sat Jul 15 04:16:54 2023
   read: IOPS=63.8k, BW=498MiB/s (522MB/s)(292GiB/600004msec)
    slat (usec): min=2, max=18141k, avg=237.15, stdev=11255.50
    clat (usec): min=207, max=18147k, avg=3775.57, stdev=45285.72
     lat (usec): min=220, max=18148k, avg=4012.95, stdev=46702.37
    clat percentiles (usec):
     |  1.00th=[   758],  5.00th=[  1418], 10.00th=[  1811], 20.00th=[  2311],
     | 30.00th=[  2704], 40.00th=[  3064], 50.00th=[  3392], 60.00th=[  3752],
     | 70.00th=[  4178], 80.00th=[  4752], 90.00th=[  5604], 95.00th=[  6587],
     | 99.00th=[  9372], 99.50th=[ 11076], 99.90th=[ 16057], 99.95th=[ 19006],
     | 99.99th=[105382]
   bw (  KiB/s): min=   47, max=41024, per=6.44%, avg=32836.34, stdev=4838.94, samples=18638
   iops        : min=    5, max= 5128, avg=4104.51, stdev=604.87, samples=18638
  lat (usec)   : 250=0.01%, 500=0.30%, 750=0.69%, 1000=1.16%
  lat (msec)   : 2=11.19%, 4=52.47%, 10=33.44%, 20=0.72%, 50=0.03%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=1.26%, sys=5.10%, ctx=21682585, majf=0, minf=670
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=38267143,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=498MiB/s (522MB/s), 498MiB/s-498MiB/s (522MB/s-522MB/s), io=292GiB (313GB), run=600004-600004msec

Disk stats (read/write):
    drbd1: ios=38265982/6, merge=0/0, ticks=64547442/17, in_queue=64547459, util=99.96%, aggrios=38271676/15, aggrmerge=0/0, aggrticks=64515685/26, aggrin_queue=64515711, aggrutil=99.67%
    dm-0: ios=38271676/15, merge=0/0, ticks=64515685/26, in_queue=64515711, util=99.67%, aggrios=38271668/15, aggrmerge=140/0, aggrticks=55725968/23, aggrin_queue=35095581, aggrutil=99.83%
  sde: ios=38271668/15, merge=140/0, ticks=55725968/23, in_queue=35095581, util=99.83%