group-reports/sharif/results/100G-disk-throughput-tuning-protocol-A-sndbuf-2M/test-4.txt
write-randomly-test-job: (g=0): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=16
...
fio-3.7
Starting 16 processes
write-randomly-test-job: Laying out IO file (1 file / 102400MiB)

write-randomly-test-job: (groupid=0, jobs=16): err= 0: pid=130370: Sat Jul 15 04:26:56 2023
  write: IOPS=6105, BW=47.7MiB/s (50.0MB/s)(27.9GiB/600029msec)
    slat (usec): min=2, max=354907, avg=2549.93, stdev=6104.56
    clat (usec): min=359, max=606416, avg=39375.68, stdev=20816.46
     lat (usec): min=373, max=656725, avg=41925.92, stdev=21326.59
    clat percentiles (msec):
     |  1.00th=[    5],  5.00th=[   12], 10.00th=[   17], 20.00th=[   23],
     | 30.00th=[   28], 40.00th=[   33], 50.00th=[   38], 60.00th=[   43],
     | 70.00th=[   48], 80.00th=[   55], 90.00th=[   65], 95.00th=[   74],
     | 99.00th=[   95], 99.50th=[  107], 99.90th=[  188], 99.95th=[  262],
     | 99.99th=[  384]
   bw (  KiB/s): min=  400, max= 4704, per=6.25%, avg=3052.02, stdev=470.83, samples=19196
   iops        : min=   50, max=  588, avg=381.49, stdev=58.86, samples=19196
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.02%, 4=0.80%, 10=3.18%, 20=10.97%, 50=59.35%
  lat (msec)   : 100=24.95%, 250=0.67%, 500=0.06%, 750=0.01%
  cpu          : usr=0.22%, sys=17.45%, ctx=37641414, majf=0, minf=151
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,3663442,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=47.7MiB/s (50.0MB/s), 47.7MiB/s-47.7MiB/s (50.0MB/s-50.0MB/s), io=27.9GiB (30.0GB), run=600029-600029msec

Disk stats (read/write):
    drbd1: ios=0/3706415, merge=0/0, ticks=0/67297996, in_queue=67297996, util=98.75%, aggrios=2459/3783068, aggrmerge=0/0, aggrticks=3855/23341953, aggrin_queue=23345808, aggrutil=92.68%
    dm-0: ios=2459/3783068, merge=0/0, ticks=3855/23341953, in_queue=23345808, util=92.68%, aggrios=1852/3766166, aggrmerge=679/16902, aggrticks=2802/22753741, aggrin_queue=20872969, aggrutil=92.67%
  sde: ios=1852/3766166, merge=679/16902, ticks=2802/22753741, in_queue=20872969, util=92.67%